---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarHandlesData
source: html/0c7b374c-01b2-10d0-6040-67dc4c7a3b37.htm
---
# RebarHandlesData Members

Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.